biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        @auctions = Auction.all.order(created_at: :DESC)

SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."price" DESC  [["auction_id", 1]]
---
    def show
        # @auction = Auction.find params[:id]
        @bid = Bid.new
        @bids = @auction.bids.order(price: :DESC)

INSERT INTO "auctions" ("title", "body", "end_date", "reserve_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @auction =Auction.new auction_params

        if @auction.save

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_auction
        @auction=Auction.find params[:id]