biddr_api/app/controllers/bids_controller.rb

    def create
        @auction = Auction.find params[:auction_id]
        @bid = Bid.new bid_params
        @bid.auction = @auction
        if @bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bids" ("price", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 715.0], ["auction_id", 1], ["created_at", "2021-02-26 18:07:03.865226"], ["updated_at", "2021-02-26 18:07:03.865226"]]