biddr_api/app/controllers/api/v1/auctions_controller.rb

    def index
        auctions = Auction.order(created_at: :DESC)
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

    def show
        @auction = Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]